БухЭксп/InformationRegisters/CW_СоставГруппУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_СоставГруппУслуг</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаУслуг</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ГруппыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_СоставГруппУслуг/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьМассивУслуг(Владелец, ГруппаУслуг) Экспорт
	
	мУслуги = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	CW_СоставГруппУслуг.Владелец КАК Владелец,
		|	CW_СоставГруппУслуг.ГруппаУслуг КАК ГруппаУслуг,
		|	CW_СоставГруппУслуг.Услуга КАК Услуга
		|ИЗ
		|	РегистрСведений.CW_СоставГруппУслуг КАК CW_СоставГруппУслуг
		|ГДЕ
		|	CW_СоставГруппУслуг.Владелец = &Владелец
		|	И CW_СоставГруппУслуг.ГруппаУслуг = &ГруппаУслуг";
	
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("ГруппаУслуг", ГруппаУслуг);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		мУслуги.Добавить(ВыборкаДетальныеЗаписи.Услуга);
	КонецЦикла;
	
	Возврат мУслуги;
	
КонецФункции

Функция ЗаполненоОграничениеУслугПоГруппам(Владелец) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	CW_СоставГруппУслуг.Владелец КАК Владелец,
	               |	CW_СоставГруппУслуг.Услуга КАК Услуга
	               |ИЗ
	               |	РегистрСведений.CW_СоставГруппУслуг КАК CW_СоставГруппУслуг
	               |ГДЕ
	               |	CW_СоставГруппУслуг.Владелец = &Владелец";
	Запрос.УстановитьПараметр("Владелец", Владелец);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции

Функция УдалитьЗаписиРегистра(КлючЗаписи) Экспорт
	
	Набор = РегистрыСведений.CW_СоставГруппУслуг.СоздатьНаборЗаписей();
	Набор.Отбор.Владелец.Установить(КлючЗаписи.Владелец);
	Набор.Отбор.ГруппаУслуг.Установить(КлючЗаписи.ГруппаУслуг);
	Набор.Прочитать();
	Набор.Очистить();
    Набор.Записать();
	
КонецФункции

Процедура СкопироватьСоставГруппУслуг(ЗначениеКопирования, Владелец) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗначенияКопирования.ГруппаУслуг КАК ГруппаУслуг,
	               |	ЗначенияКопирования.Услуга КАК Услуга,
	               |	ВЫБОР
	               |		КОГДА ДанныеДляЗаполнения.ГруппаУслуг ЕСТЬ NULL
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК Копировать
	               |ПОМЕСТИТЬ ВТ_ЗначенияКопирования
	               |ИЗ
	               |	РегистрСведений.CW_СоставГруппУслуг КАК ЗначенияКопирования
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_СоставГруппУслуг КАК ДанныеДляЗаполнения
	               |		ПО ЗначенияКопирования.ГруппаУслуг = ДанныеДляЗаполнения.ГруппаУслуг
	               |			И (ЗначенияКопирования.Владелец = &ЗначениеКопирования)
	               |			И (ДанныеДляЗаполнения.Владелец = &Владелец)
	               |ГДЕ
	               |	ЗначенияКопирования.Владелец = &ЗначениеКопирования
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	&Владелец КАК Владелец,
	               |	ВТ_ЗначенияКопирования.ГруппаУслуг КАК ГруппаУслуг,
	               |	ВТ_ЗначенияКопирования.Услуга КАК Услуга
	               |ИЗ
	               |	ВТ_ЗначенияКопирования КАК ВТ_ЗначенияКопирования
	               |ГДЕ
	               |	ВТ_ЗначенияКопирования.Копировать = ИСТИНА";

	Запрос.УстановитьПараметр("ЗначениеКопирования", 	ЗначениеКопирования);
	Запрос.УстановитьПараметр("Владелец", 				Владелец);

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	НаборРегистра = РегистрыСведений.CW_СоставГруппУслуг.СоздатьНаборЗаписей();
	НаборРегистра.Отбор.Владелец.Установить(Владелец);
	НаборРегистра.Прочитать();
	
	Пока Выборка.Следующий() Цикл
		СтрокаНабора = НаборРегистра.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаНабора, Выборка);
	КонецЦикла;
	
	НаборРегистра.Записать();
	
КонецПроцедуры

#КонецЕсли
